export const news = [
    {
        date: '15.11.2023',
        title: 'Ціна оренди',
        text: 'З 15.11.2023 діють нові ціни на бронювання зйомок. Нова вартість оренди 750 грн/год. Також діють знижки при бронюванні від 1 години (крім групових зйомок).',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '9.11.2023',
        title: 'Новинка техніки - генератор снігу',
        text: 'Вам більше не треба чекати, поки піде сніг надворі! Генератор снігу додасть атмосфери до ваших новорічних фотосесій❄️ І саме головне – це все в приміщенні! Входить у вартість оренди',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '1.11.2023',
        title: 'Новорічні фотозони',
        text: 'Вже відкрито бронювання на новорічні зйомки ✨ Казкові фотозони вже чекають на вас. Ялинки прикрашені, золотий місяць сяє, святковий одяг підготовлений – все як треба☺️ Чекаємо вас в гості!',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '28.09.2023',
        title: 'Новий елемент техніки – стріпбокс',
        text: 'В студії тепер є два стріп-бокси, які можна використовувати для створення нових схем світла. Входять у вартість оренди🔥',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '27.09.2023',
        title: 'Осіння фотозона',
        text: 'Вже йде бронювання на нову осінню фотозону, яка насичена багряними відтінками цього чарівного сезону. А картаті сорочки, до речі, доступні до оренди. Чекаємо вас на зйомку🙂',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '22.09.2023',
        title: 'Новий одяг',
        text: 'В Sky Studio додався ще один елемент одягу в оренду – чорна сукня-сіточка. Вона еластична і підійде на розмір S-M',
        picture: { image: 'photo56.jpg', width: 960, height: 1280 }
    },
    {
        date: '22.08.2023',
        title: 'Нова фотозона',
        text: 'Маємо справжню новинку для вас – фотозону з піском – фотозону, де можна створити гарячі фото🔥',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '20.08.2023',
        title: 'Лазер',
        text: 'Новинка – лазер в фотостудії в Ужгороді. Тільки погляньте, які неймовірні фото можна з зробити🔥 Лазер входить у вартість оренди! Чекаємо вас в Sky Studio☺️',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '15.08.2023',
        title: 'Подарунковий сертифікат',
        text: 'Ви можете придбати сертифікат на зйомку в нашій фотостудії. Порадуйте своїх рідних і близьких оригінальним подарунком. Щоб замовити сертифікат, звʼяжіться з нами',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '07.08.2023',
        title: 'Фотозона Barbie',
        text: 'Маємо для вас тематичну фотозону в стилі Барбі. Є рожевий одяг, взуття та навіть коробки під стиль. В нашій студії перевтілення можливі🪄 Чекаємо вас 💖',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '03.08.2023',
        title: 'Нова фотозона',
        text: 'Мінімалістична зона з шкіряним кріслом і зеленою стіною вже доступна до бронювання. Чекаємо вас в Sky Studio за адресою м. Ужгород, вул. Залізнична 1А 😉',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '01.08.2023',
        title: 'Новий реквізит',
        text: 'В Скай студіо зʼявився новий реквізит для зйомок - диванчик особливої форми, білі полички різної висоти, диско-шар. Детальніше в розділі Фотозони >> Додатковий реквізит',
        picture: { image: 'photo6.jpg', width: 960, height: 1280 }
    },
    {
        date: '22.07.2023',
        title: 'Нова фотозона',
        text: 'Зона для немовлят з фруктами - вже доступна до бронювання. Зазвичай дітки люблять бавитися в воді, тому ми організували цю зону саме для них👼🏻',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '20.07.2023',
        title: 'Нове кольорове світло',
        text: 'Це справжня новинка для фотографів - постійне кольорове світло Godox🔥 Можна виставити будь-який колір спектру для вашої зйомки. Входить у вартість оренди😉',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '18.07.2023',
        title: 'Барбі',
        text: 'В нашій студії зʼявились сукні на маму і дитину в стилі Барбі. Також маємо дві пари жіночих босоніжок в рожевому кольорі. Образи вже доступні до оренди',
        picture: { image: 'photo1.jpg', width: 960, height: 1280 }
    },
    {
        date: '27.06.2023',
        title: 'Новий одяг',
        text: 'В нас зʼявився новий одяг для оренди. Два чорні піджаки, червоний боді Coca-Cola, чорний корсет, сукня-сітка. Переглянути можна в розділі «Сукні та аксесуари» – «Інший одяг для дорослих»',
        picture: { image: 'bodik.jpg', width: 960, height: 1280 }
    },
    {
        date: '25.06.2023',
        title: 'Відбивач світла',
        text: 'В Скай студії тепер є новий елемент техніки - відбивач світла 5 в 1. Можете використовувати його під час своїх зйомок. Це входить у вартість оренди :)',
        picture: { image: 'vidbyvach.jpg', width: 960, height: 1280 }
    },
    {
        date: '22.06.2023',
        title: 'Ідеї фотозон',
        text: 'В нас на сайті зʼявився новий блок для вас - Ідеї фотозон. Там ми будемо додавати різні фотозони, які можна сконструювати в Sky Studio для вас. Детальніше про це в розділі «Фотозони»',
        picture: { image: 'ideya.jpg', width: 960, height: 1280 }
    },
    {
        date: '20.06.2023',
        title: 'Нові тканини',
        text: 'В Sky Studio зʼявились нові тканини - чорна, біла і бежева. З ними можна реалізувати різні творчі ідеї. Переглянути детальніше, як їх використовувати, ви можете в розділі <a href="/fotozony">«Фотозони»</a> – «Ідеї фотозон»',
        picture: { image: 'novi-tkanyny.jpg', width: 960, height: 1280 }
    },
    {
        date: '18.06.2023',
        title: 'Дитячий куточок',
        text: 'В студії SKY зʼявилася зона для дітей. Поки ви зайняті фотозйомкою, діти можуть тут бавитися собі окремо. Також можна цю зону використовувати для фотосесії з дітьми.',
        picture: { image: 'dyt-kut.jpg', width: 960, height: 1280 }
    },
    {
        date: '15.06.2023',
        title: 'Календар бронювань',
        text: 'На сайті Cкай студії зʼявився зручний <a href="/#calendar">календар перегляду бронювань</a> зйомок. Тепер ви можете переглянути, чи вільні дата і час, коли ви бажаєте прийти на зйомку.',
        picture: { image: 'calendar-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '10.06.2023',
        title: 'Рожевий фон',
        text: 'Тепер маємо також для вас ніжно-рожевий фотофон. Він світлий, милий і підійде для різних цілей - хоч для портретних кадрів, хоч для предметної зйомки. Як вам любиться :)',
        picture: { image: 'rozhevyi-fon-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '09.06.2023',
        title: 'Червоний фон',
        text: 'Яскравий насичений червоний фон вже доступний для ваших зйомок. До цього фону чудово пасує наш нова ефектна шляпа з бахромою.',
        picture: { image: 'chervonyi-fon-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '05.06.2023',
        title: 'Новий аксесуар',
        text: 'В нас зʼявився новий капелюх з бахромою, який гарно доповнить ваші образи. Оренда - 200 грн',
        picture: { image: 'kapelyuh-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '30.05.2023',
        title: 'Новий реквізит',
        text: 'В Sky Studio зʼявився додатковий реквізит для вашої фотозйомки - 2 куби, чорний і білий. Куби допоможуть вам реалізувати різні творчі ідеї і урізноманітнити вашу зйомку.',
        picture: { image: 'photo1-1x.jpg', width: 1280, height: 1280 }
    },
    {
        date: '30.05.2023',
        title: 'Новий стілець',
        text: 'В нашій студії зʼявився новий стілець для ваших портретних зйомок. Стілець регулюється по висоті, що є важливою умовою для комфортної зйомки.',
        picture: { image: 'photo2-1x.jpg', width: 960, height: 1280 }
    }
]