export const news = [
    {
        date: '27.06.2023',
        title: 'Новий одяг',
        text: 'В нас зʼявився новий одяг для оренди. Два чорні піджаки, червоний боді Coca-Cola, чорний корсет, сукня-сітка. Переглянути можна в розділі «Сукні та аксесуари» – «Інший одяг для дорослих»',
        picture: { image: 'bodik.jpg', width: 960, height: 1280 }
    },
    {
        date: '25.06.2023',
        title: 'Відбивач світла',
        text: 'В Скай студії тепер є новий елемент техніки - відбивач світла 5 в 1. Можете використовувати його під час своїх зйомок. Це входить у вартість оренди :)',
        picture: { image: 'vidbyvach.jpg', width: 960, height: 1280 }
    },
    {
        date: '22.06.2023',
        title: 'Ідеї фотозон',
        text: 'В нас на сайті зʼявився новий блок для вас - Ідеї фотозон. Там ми будемо додавати різні фотозони, які можна сконструювати в Sky Studio для вас. Детальніше про це в розділі «Фотозони»',
        picture: { image: 'ideya.jpg', width: 960, height: 1280 }
    },
    {
        date: '20.06.2023',
        title: 'Нові тканини',
        text: 'В Sky Studio зʼявились нові тканини - чорна, біла і бежева. З ними можна реалізувати різні творчі ідеї. Переглянути детальніше, як їх використовувати, ви можете в розділі <a href="/fotozony">«Фотозони»</a> – «Ідеї фотозон»',
        picture: { image: 'novi-tkanyny.jpg', width: 960, height: 1280 }
    },
    {
        date: '18.06.2023',
        title: 'Дитячий куточок',
        text: 'В студії SKY зʼявилася зона для дітей. Поки ви зайняті фотозйомкою, діти можуть тут бавитися собі окремо. Також можна цю зону використовувати для фотосесії з дітьми.',
        picture: { image: 'dyt-kut.jpg', width: 960, height: 1280 }
    },
    {
        date: '15.06.2023',
        title: 'Календар бронювань',
        text: 'На сайті Cкай студії зʼявився зручний <a href="/#calendar">календар перегляду бронювань</a> зйомок. Тепер ви можете переглянути, чи вільні дата і час, коли ви бажаєте прийти на зйомку.',
        picture: { image: 'calendar-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '10.06.2023',
        title: 'Рожевий фон',
        text: 'Тепер маємо також для вас ніжно-рожевий фотофон. Він світлий, милий і підійде для різних цілей - хоч для портретних кадрів, хоч для предметної зйомки. Як вам любиться :)',
        picture: { image: 'rozhevyi-fon-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '09.06.2023',
        title: 'Червоний фон',
        text: 'Яскравий насичений червоний фон вже доступний для ваших зйомок. До цього фону чудово пасує наш нова ефектна шляпа з бахромою.',
        picture: { image: 'chervonyi-fon-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '05.06.2023',
        title: 'Новий аксесуар',
        text: 'В нас зʼявився новий капелюх з бахромою, який гарно доповнить ваші образи. Оренда - 200 грн',
        picture: { image: 'kapelyuh-1x.jpg', width: 960, height: 1280 }
    },
    {
        date: '30.05.2023',
        title: 'Новий реквізит',
        text: 'В Sky Studio зʼявився додатковий реквізит для вашої фотозйомки - 2 куби, чорний і білий. Куби допоможуть вам реалізувати різні творчі ідеї і урізноманітнити вашу зйомку.',
        picture: { image: 'photo1-1x.jpg', width: 1280, height: 1280 }
    },
    {
        date: '30.05.2023',
        title: 'Новий стілець',
        text: 'В нашій студії зʼявився новий стілець для ваших портретних зйомок. Стілець регулюється по висоті, що є важливою умовою для комфортної зйомки.',
        picture: { image: 'photo2-1x.jpg', width: 960, height: 1280 }
    }
]